Revit 2016 API
DuctSizeSettings Class
 Duct sizes settings
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2013
Syntax
C#
public class DuctSizeSettings : Element
Visual Basic
Public Class DuctSizeSettings _
	Inherits Element
Visual C++
public ref class DuctSizeSettings : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Mechanical.DuctSizeSettings
See Also
DuctSizeSettings Members
Autodesk.Revit.DB.Mechanical Namespace